web/app/controllers/posts_controller.rb

  def create
    # @post = Post.new(:title => params[:title], :edition => params[:edition], :price => params[:price], :isbn => params[:isbn], :cover_type => params[:cover_type])
    @post = Post.create(post_params)
---
INSERT INTO `posts` (`cover_type`, `created_at`, `edition`, `isbn`, `price`, `title`, `updated_at`) VALUES (1, '2013-09-15 23:16:49', 5, 9788126521517.0, 65.0, 'Communication Systems', '2013-09-15 23:16:49')