ubs_web/app/controllers/posts_controller.rb

INSERT INTO `posts` (`cover_type`, `created_at`, `device`, `edition`, `isbn`, `price`, `title`, `updated_at`) VALUES (1, '2013-09-25 20:54:30', 'Android', 1, 9781234567890.0, 10.0, 'Android Test', '2013-09-25 20:54:30')
---
  def create
    @post = Post.new(post_params)

    if params[:post][:device].eql? "Android"
      respond_to do |format|
        format.html # create.html.erb
        format.xml  { render :xml => @post }
        format.json { render :json => @post }
      end

      # Save post, should send suitable response code to device on success or failure
      @post.save